testEdo/Labs/Lab04-HeatTransfer/combustor2D-RPF-highRe-highT/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         	Gauss linear;
    grad(U)		cellLimited	Gauss	linear	1;
    grad(Phi)		leastSquares;			// potentialFoam
}

divSchemes
{
    default         			none;
    div(phi,U)      			Gauss linearUpwind grad(U);
    div(div(phi,U))			Gauss linear;	// potentialFoam
    div(phi,k)      			Gauss limitedLinear 1;
    div(phi,epsilon) 			Gauss limitedLinear 1;
    div(phi,omega)  			Gauss limitedLinear 1;
    div(phi,v2)     			Gauss limitedLinear 1;
    div(phi,h)				Gauss limitedLinear 1;
    div(phi,K)				Gauss limitedLinear 1;
    div(((rho*nuEff)*dev2(T(grad(U)))))	Gauss linear;
    div(nonlinearStress) 		Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
