testEdo/Labs/Lab04-HeatTransfer/combustor2D-RPF-highRe-highT/system/functionObjects/integralValues
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

pInlet
{
	type		surfaceFieldValue;
	enabled		yes;
	log		true;
			
	writeControl	writeTime;
	writeInterval	1;
	regionType	patch;
	writeFields	no;
	name		inlet;
	operation	average;
	fields		(p);
	libs		("libfieldFunctionObjects.so");
}

pOutlet
{
	type		surfaceFieldValue;
	enabled		yes;
	log		true;
			
	writeControl	writeTime;
	writeInterval	1;
	regionType	patch;
	writeFields	no;
	name		outlet;
	operation	average;
	fields		(p);
	libs		("libfieldFunctionObjects.so");
}




// ************************************************************************* //
